In [1]:
import pandas as pd
import numpy as np
import sys
import json
import lxml
import csv
import requests
import sqlite3
import sqlalchemy as sqla

from lxml import objectify

In [2]:
""" 

<<< Chapter 6.1 Reading and Writing Data in Text Format

"""

' \n\n<<< Chapter 6.1 Reading and Writing Data in Text Format\n\n'

In [3]:
!cat ../examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [4]:
df = pd.read_csv("../examples/ex1.csv")

In [5]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
!cat ../examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
pd.read_csv("../examples/ex2.csv", header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [8]:
pd.read_csv("../examples/ex2.csv", names=["a", "b", "c", "d", "message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
names = ["a", "b", "c", "d", "message"]

In [10]:
pd.read_csv("../examples/ex2.csv", names=names, index_col="message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [11]:
!cat ../examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [12]:
parsed = pd.read_csv("../examples/csv_mindex.csv", index_col = ["key1", "key2"])

In [13]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [14]:
!cat ../examples/ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [15]:
result = pd.read_csv("../examples/ex3.txt", sep="\\s+")

In [16]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [17]:
!cat ../examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [18]:
pd.read_csv("../examples/ex4.csv", skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
!cat ../examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [20]:
result = pd.read_csv("../examples/ex5.csv")

In [21]:
result.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [22]:
result = pd.read_csv("../examples/ex5.csv", na_values=["NULL"])

In [23]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [24]:
result2 = pd.read_csv("../examples/ex5.csv", keep_default_na=False)

In [25]:
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [26]:
result.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [27]:
result3 = pd.read_csv("../examples/ex5.csv", keep_default_na=False, na_values=["NA"])

In [28]:
result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [29]:
result.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [30]:
sentinels = {"message":["foo", "NA"], "something": ["two"]}

In [31]:
pd.read_csv("../examples/ex5.csv", na_values=sentinels,
            keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

In [32]:
pandas.read_csv?

Object `pandas.read_csv` not found.

In [33]:
""" 

<<< Chapter 6.1.2 Reading Text Files in Pieces >>>

"""

' \n\n<<< Chapter 6.1.2 Reading Text Files in Pieces >>>\n\n'

In [34]:
pd.options.display.max_rows = 10

In [35]:
result = pd.read_csv("../examples/ex6.csv")

In [36]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [37]:
pd.read_csv("../examples/ex6.csv", nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [38]:
chunker = pd.read_csv("../examples/ex6.csv", chunksize=1000)

In [39]:
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [40]:
tot = pd.Series([], dtype='int64')

In [41]:
for piece in chunker:
    tot = tot.add(piece["key"].value_counts(), fill_value=0)

In [42]:
tot = tot.sort_values(ascending=False)

In [43]:
tot[:10]

key
E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [44]:
""" 

<<< Chapter 6.1.3 Writing Data to Text Format >>>

"""

' \n\n<<< Chapter 6.1.3 Writing Data to Text Format >>>\n\n'

In [45]:
data = pd.read_csv("../examples/ex5.csv")

In [46]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [47]:
data.to_csv("../examples/out.csv")

In [48]:
!cat ../examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [49]:
data.to_csv(sys.stdout, sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [50]:
data.to_csv(sys.stdout, na_rep="NULL")

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [51]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [52]:
""" 

<<< Chapter 6.1.4 Working with Other Delimited Formats >>>

"""

' \n\n<<< Chapter 6.1.4 Working with Other Delimited Formats >>>\n\n'

In [53]:
!cat ../examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [54]:
f = open("../examples/ex7.csv")

In [55]:
reader = csv.reader(f)

In [56]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [57]:
f.close()

In [58]:
with open("../examples/ex7.csv") as f:
    lines = list(csv.reader(f))

In [59]:
header, values = lines[0], lines[1:]

In [60]:
data_dict = {h:v for h,v in zip(header, zip(*values))}

In [61]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [62]:
class my_dialect(csv.Dialect):
    lineterminator = "\n"
    delimiter = ";"
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [63]:
with open("../examples/ex7.csv") as f:
    reader = csv.reader(f, dialect = my_dialect)
    for line in reader:
        print(line)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

In [64]:
!cat ../examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [65]:
with open("mydata.csv", "w") as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(("one", "two", "three"))
    writer.writerow(("1", "2", "3"))
    writer.writerow(("4", "5", "6"))
    writer.writerow(("7", "8", "9"))

In [66]:
!cat mydata.csv

one;two;three
1;2;3
4;5;6
7;8;9

In [67]:
""" 

<<< Chapter 6.1.5 JSON Data >>>

"""

' \n\n<<< Chapter 6.1.5 JSON Data >>>\n\n'

In [68]:
obj = """
{"name": "Wes",
"cities_lived":["Akron", "Nashville", "New York", "San Francisco"],
"pet": null,
"siblings":[{"name":"Scott","age": 34, "hobbies":["guitars", "soccer"]},
    {"name": "Katie", "age": 42, "hobbies": ["driving", "art"]}]
}
"""

In [69]:
result = json.loads(obj)

In [70]:
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['driving', 'art']}]}

In [71]:
asjson = json.dumps(result)

In [72]:
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["driving", "art"]}]}'

In [73]:
siblings = pd.DataFrame(result["siblings"], columns=["name", "age"])

In [74]:
siblings

    name  age
0  Scott   34
1  Katie   42

In [75]:
!cat ../examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [76]:
data = pd.read_json("../examples/example.json")

In [77]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [78]:
data.to_json(sys.stdout)

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [79]:
data.to_json(sys.stdout, orient="records")

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [80]:
""" 

<<< Chapter 6.1.6 XML and HTML: Web Scraping >>>

"""

' \n\n<<< Chapter 6.1.6 XML and HTML: Web Scraping >>>\n\n'

conda install --yes --file ../requirements.txt

In [81]:
tables = pd.read_html("../examples/fdic_failed_bank_list.html")

In [82]:
len(tables)

1

In [83]:
failures = tables[0]

In [84]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [85]:
close_timestamps = pd.to_datetime(failures["Closing Date"])

In [86]:
close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, Length: 15, dtype: int64

In [87]:
""" 

<<< Chapter 6.1.7 Parsing XML with lxml.objectify >>>

"""

' \n\n<<< Chapter 6.1.7 Parsing XML with lxml.objectify >>>\n\n'

In [88]:
path = "../datasets/mta_perf/Performance_MNR.xml"

In [89]:
with open(path) as f:
    parsed = objectify.parse(f)

In [90]:
root = parsed.getroot()

In [91]:
data = []
skip_fields = ["PARENT_SEQ", "INDICATOR_SEQ", "DESIRED_CHANGE", "DECIMAL_PLACES"]

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [92]:
perf = pd.DataFrame(data)

In [93]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [94]:
perf2 = pd.read_xml(path)

In [95]:
perf2.drop(columns=skip_fields).head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.00,96.90,95.00,96.90
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.00,96.00,95.00,95.00
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.00,96.30,95.00,96.90
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.00,96.80,95.00,98.30
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.00,96.60,95.00,95.80

In [96]:
""" 

<<< Chapter 6.2 Binary Data Formats >>>

"""

' \n\n<<< Chapter 6.2 Binary Data Formats >>>\n\n'

In [97]:
frame = pd.read_csv("../examples/ex1.csv")

In [98]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [99]:
frame.to_pickle("../examples/frame_pickle")

In [100]:
pd.read_pickle("../examples/frame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [101]:
""" 

<<< Chapter 6.2.1 Reading Microsoft Excel Files >>>

"""

' \n\n<<< Chapter 6.2.1 Reading Microsoft Excel Files >>>\n\n'

In [102]:
conda install openpyxl xlrd

Channels:
 - defaults
Platform: linux-64
Collecting package metadata (repodata.json): done
Solving environment: done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [103]:
xlsx = pd.ExcelFile("../examples/ex1.xlsx")

In [104]:
xlsx.sheet_names

['Sheet1']

In [105]:
xlsx.parse(sheet_name="Sheet1", index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [106]:
frame = pd.read_excel("../examples/ex1.xlsx", sheet_name="Sheet1")

In [107]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [108]:
writer = pd.ExcelWriter("../examples/ex2.xlsx")

In [109]:
frame.to_excel(writer, sheet_name="Sheet1")

In [110]:
writer.close()

In [111]:
xlsx2 = pd.ExcelFile("../examples/ex2.xlsx")

In [112]:
xlsx2.sheet_names

['Sheet1']

In [113]:
xlsx2.parse(sheet_name="Sheet1",index_col=0)

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [114]:
frame = pd.DataFrame({"a": np.random.standard_normal(100)})

In [115]:
store = pd.HDFStore("../examples/mydata.h5")

In [116]:
store["obj1"] = frame

In [117]:
store["obj1_col"] = frame["a"]

In [118]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: ../examples/mydata.h5

In [119]:
store["obj1"]

           a
0  -1.043388
1   2.100913
2   1.074880
3   2.906073
4  -0.419525
..       ...
95 -0.715463
96 -0.683213
97 -0.462234
98 -0.706404
99 -0.057370

[100 rows x 1 columns]

In [120]:
store.put("obj2", frame, format="table")

In [121]:
store.select("obj2", where=["index >= 10 and index <= 15"])

           a
10 -2.198518
11  0.142749
12  0.494493
13 -0.954331
14  0.230905
15 -0.168091

In [122]:
store.close()

In [123]:
pd.read_hdf("../examples/mydata.h5", "obj3", where=["index < 5"])

          a
0  0.559194
1 -0.598524
2  0.466073
3 -0.559751
4  2.941575

In [124]:
""" 

<<< Chapter 6.3 Interacting with Web API's >>>

"""

" \n\n<<< Chapter 6.3 Interacting with Web API's >>>\n\n"

In [125]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [126]:
resp = requests.get(url)

In [127]:
resp.raise_for_status()

In [128]:
resp

In [129]:
data = resp.json()

In [130]:
data[0]["title"]

'Add column_offset to explode'

In [131]:
issues = pd.DataFrame(data, columns=["number","title", "labels", "state"])

In [132]:
issues

,number,title,labels,state
0,59238,Add column_offset to explode,[],open
1,59237,ENH: Reduce type requirements for the subset p...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
2,59235,ENH: Consistent API between `pd.get_dummies()`...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
3,59234,BUG/TST: non-numeric EA reductions,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,59233,BUG: json_normalize KeyError Key not found,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
...,...,...,...,...
25,59193,ENH: Pipe `attrs` to_html Jinja2 environmental...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
26,59192,"BUG: Pyarrow series .any() returns a bool, mes...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,59190,DataFrameGroupBy.agg with nan results error Fixed,[],open
28,59189,DataFrame.eval error fixed,[],open
29,59188,Difference between calamine and openpyxl reade...,[],open

In [157]:
""" 

<<< Chapter 6.4 Interacting with Databases >>>

"""

' \n\n<<< Chapter 6.4 Interacting with Databases >>>\n\n'

In [158]:
query = "DROP TABLE IF EXISTS test;"

In [159]:
con = sqlite3.connect("mydata.sqlite")

In [160]:
con.execute(query)

In [161]:
con.commit()

In [162]:
con.close()

In [163]:
query = """
CREATE TABLE test
(a VARVHAR(20), b VARCHAR(20),
c REAL,     d INTEGER
);"""

In [164]:
con = sqlite3.connect("mydata.sqlite")

In [165]:
try:
    con.execute(query)
except Exception:
    pass

In [166]:
con.commit()

In [167]:
data = [("Atlanta", "Georgia", 1.25, 6),
        ("Tallahassee", "Florida", 2.6, 3),
        ("Sacremento", "California", 1.7, 5)]

In [168]:
stmt = "INSERT INTO test VALUES(?,?,?,?)"

In [169]:
con.executemany(stmt, data)

In [170]:
con.commit()

In [171]:
cursor = con.execute("SELECT * FROM test")

In [172]:
rows = cursor.fetchall()

In [173]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacremento', 'California', 1.7, 5)]

In [174]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [175]:
rows = rows[:3]

In [176]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacremento', 'California', 1.7, 5)]

In [177]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacremento  California  1.70  5

In [178]:
db = sqla.create_engine("sqlite:///mydata.sqlite")

In [179]:
pd.read_sql("SELECT * FROM test", db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacremento  California  1.70  5